Revit 2027 API
RuledFace.IsExtruded Property
Determines if this is an extruded ruled surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsExtruded { get; }
Public ReadOnly Property IsExtruded As Boolean
	Get
public:
property bool IsExtruded {
	bool get ();
}
member IsExtruded : bool with get
Property Value
Boolean
See Also
Reference
RuledFace Class
Autodesk.Revit.DB Namespace